package ui;

import javax.swing.*;

public class InfoDialog {
    // Метод для отображения информационного окна
    public static void showInfoDialog() {
        String message = "Добро пожаловать в HEX-редактор!\n\n" +
                "Это приложение предназначено для просмотра и редактирования файлов как последовательности байтов,\n" +
                "отображаемых в виде шестнадцатеричных значений.\n\n" +
                "Основные функции:\n" +
                "1. Просмотр и редактирование байтов.\n" +
                "2. Поддержка блоков данных размером 2, 4 и 8 байт (целые и вещественные).\n" +
                "3. Функция поиска последовательностей байт по значению или маске.\n" +
                "4. Копирование, вырезание и вставка блоков байт с разными способами обработки данных.\n" +
                "5. Работа с файлами, превышающими объем доступной памяти.\n\n" +
                "Для начала работы используйте кнопки на панели управления:\n" +
                "- Открыть файл: загрузите файл для редактирования.\n" +
                "- Сохранить файл: сохраните изменения.\n" +
                "- Изменить: редактируйте выделенные байты.\n" +
                "- Удалить: удалите выбранные байты.\n" +
                "- Копировать/Вырезать/Вставить: работайте с данными в выбранном диапазоне.\n\n" +
                "Исходный код доступен на GitHub: https://github.com/Dvimin/hex_editor";

        String title = "Информация о HEX-редакторе";

        JOptionPane.showMessageDialog(null, message, title, JOptionPane.INFORMATION_MESSAGE);
    }
}
